lexicon = {
    "/start": ("Привет, {}!\nЯ бот, который расскажет тебе о погоде на сегодня ⛅️\n\n"
               "/menu – все доступные команды"),
    "": "",
    "main_menu_user": "Главное меню",
    "admin_menu": "Меню админа\n\n/menu – перейти в меню пользователя",
    "list_of_users": "📋 Список пользователей",
    "all_bot_users": "Все пользователи бота:",
    "set_my_city_fbk": "Запомнил, {user_city} – ваш город ✅",
    "enter_the_city_name": "Введите название города:",
    "cancel": "↩️ Отмена",
    "incorrect_city_name": "Город не найден, попробуйте снова",
    "user_city_weather": "☀️ Погода в моем городе",
    "other_city_weather": "🌧️ Погода в другом месте",
    "random_city_weather": "️🎲 Погода в случайном городе",
    "history": "⏳ История",
    "set_my_city": "⚙️ Установить свой город",
    "change_my_city": "⚙️ Изменить свой город",
    "no_city": ("Ваш город ещё не указан 🤷‍♂️\n\n"
                "Вы можете сделать это либо запросить в меню погоду для любого города ⬇️"),
    "choose_another_city": "🌧 Выбрать другой город",
    "get_the_weather_in_my_city": "⛅ Узнать погоду в моем городе",
    "no_user_city": "Вы ещё не выбрали свой город.\n Можете сделать это в меню либо запросить погоду в другом месте",
    "request_history": "Ваша история запросов:\n",
    "user_format": "{item[0]}) id: {item[1]}, подключился {item[2]}, {item[3]} отчётов",
    "report_format": "✅ {item[1]} {item[2]}.{item[3]}.{item[4]}",
    "back": "⬅️ Назад",
    "forward": "Вперед ➡️",
    "delete": "🗑️Удалить запрос",
    "to_main_menu": "☰ В главное меню",
    "weather_report": ("Сегодня: {date}\n\n"
                       "Погода в: {country_emoji} {city} ({country}):\n\n"
                       "Температура воздуха: 🌡 {temp} °C\n"
                       "Ощущается как: 🌡 {feels_like} °C\n"
                       "Погодные условия: {weather_condition}\n\n"
                       "Скорость ветра: 💨 {wind_speed} км/ч\n"
                       "Атм. давление: 🗜 {pressure} мм рт. ст.\n"
                       "Видимость: 👁️ {visibility} км\n"),
    "show_history_report": ("Данные по запросу:\n\n"
                            "Дата: {date}\n\n"
                            "Город: {city} ({country})\n"
                            "Температура воздуха: 🌡 {temp} °C\n"
                            "Ощущается как: 🌡 {feels_like} °C\n"
                            "Погодные условия: {weather_condition}\n\n"
                            "Скорость ветра: 💨 {wind_speed} км/ч\n"
                            "Атм. давление: 🗜 {pressure} мм рт. ст.\n"
                            "Видимость: 👁️ {visibility} км"),
}
